feat: adjust readme
